tap "derailed/k9s"
tap "hashicorp/tap"
tap "tokuhirom/tap"
# Simple, modern, secure file encryption
brew "age"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Shell extension to jump to frequently used directories
brew "autojump"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way of working with Protocol Buffers
brew "buf"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Statistics utility to count lines of code
brew "cloc"
# Dependency Manager for PHP
brew "composer"
# Git diff pager based on delta but with a file tree
brew "diffnav"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# Kubernetes package manager
brew "helm@3"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Helm Charts as Code tool
brew "helmsman"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Run a Kubernetes cluster locally
brew "minikube"
# QUIC transport protocol implementation
brew "mvfst"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Manage multiple Node.js versions
brew "nvm"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# General-purpose scripting language
brew "php@8.2"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line utility to interact with Sentry
brew "sentry-cli"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Work with remote images registries
brew "skopeo"
# Editor of encrypted files
brew "sops"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# High-performance data structure server that primarily serves key/value workloads
brew "valkey"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# Android SDK component
cask "android-platform-tools"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fira-code-nerd-font"
# GPU-based terminal emulator
cask "kitty"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# OpenJDK distribution from Azul
cask "zulu@17"
vscode "tilt-dev.tiltfile"
krew "ctx"
krew "krew"
krew "ns"
npm "@nestjs/cli"
npm "@quartermaster/commitlint"
npm "conventional-changelog-conventionalcommits"
npm "corepack"
npm "zsh-history-enquirer"
